# CheHui Plugin Configuration

# ================================================================= #
# |                        撤回规则配置                           | #
# ================================================================= #
# 配置机器人需要自动撤回消息的规则。
#
# 每条规则是一个字典，包含两个键:
#   - "keywords": 一个包含触发关键词的集合 (set)。当用户发送的消息以其中任何一个关键词开头时，规则被触发。
#   - "delay": 一个整数，表示机器人发送消息后，等待多少秒再执行撤回操作。
#
# 你可以根据需要添加、修改或删除规则。
#
# 示例:
# {
#     "keywords": {"关键词1", "关键词2"},
#     "delay": 10  # 10秒后撤回
# }
# ================================================================= #

retraction_rules: list[dict[str, set[str] | int]] = [
    {
        "keywords": {
            "打卡",
            "签到",
            "查询签到",
            "报道",
            "签到排行",
            "签到排名",
            "首日签到",
        },
        "delay": 60,
    },
    {"keywords": {"今日运势", "抽签", "运势", "jrys"}, "delay": 60},
    {"keywords": {"你好11111", "test1"}, "delay": 60},
    # {"keywords": {"admin_cmd_recall"}, "delay": 3},
    # --- 在这里添加更多规则 ---
]
